import survival
import subdomain
import port
import finger

def display_banner():
    print("========================================================================================================================")
    print('\n'
        '\033[34m'
        '  /$$$$$$   /$$$$$$  /$$   /$$     /$$$$$$$$                  /$$          \n'
        ' /$$__  $$ /$$__  $$| $$  / $$    |__  $$__/                 | $$          \n'
        '| $$  \\__/| $$  \\__/|  $$/ $$/       | $$  /$$$$$$   /$$$$$$ | $$  /$$$$$$$\n'
        '|  $$$$$$ | $$       \\  $$$$/ /$$$$$$| $$ /$$__  $$ /$$__  $$| $$ /$$_____/\n'
        ' \\____  $$| $$        >$$  $$|______/| $$| $$  \\ $$| $$  \\ $$| $$|  $$$$$$ \n'
        ' /$$  \\ $$| $$    $$ /$$/\\  $$       | $$| $$  | $$| $$  | $$| $$ \\____  $$\n'
        '|  $$$$$$/|  $$$$$$/| $$  \\ $$       | $$|  $$$$$$/|  $$$$$$/| $$ /$$$$$$$/\n'
        ' \\______/  \\______/ |__/  |__/       |__/ \\______/  \\______/ |__/|_______/\n'
        '\033[0m'
    )
    print("========================================================================================================================")
    print("\033[31m本工具仅作教学，学习及有授权的合法行为使用，切勿用作违法用途！\033[0m")
    print("[\033[34m*\033[0m] \033[35m一款用于渗透测试的简易工具\033[0m")
    print("[\033[34m*\033[0m] \033[35mversion:1.0.0\033[0m")
    print("[\033[34m*\033[0m] \033[35mBY.HUITAILANG11\033[0m")
    print("[\033[34m*\033[0m] \033[35m联系作者：aac666655\033[0m")
    print("[\033[34m*\033[0m] \033[35m小白开发，各方面都有点拉，不好用咱就删了吧，求别骂\033[0m ┗( T﹏T )┛投降")
    print("[\033[34m*\033[0m] \033[35m更新新功能完善各功能ing...\033[0m")
    print("[\033[34m*\033[0m] \033[35mGitHub:\033[34mhttps://github.com/HUITAILANG11/SCX-Tools\033[0m")
    print()

def menu():
    print("[\033[32m1\033[0m] \033[33m存活扫描\033[0m (\033[32m将需要批量检测存活的站点放入当前目录下的 scan_survival_urls.txt 文件\033[0m)")
    print("[\033[32m2\033[0m] \033[33m域名收集\033[0m")
    print("[\033[32m3\033[0m] \033[33m端口扫描\033[0m")
    print("[\033[32m4\033[0m] \033[33m指纹识别\033[0m (\033[32m需要配合FOFA使用\033[0m)")
    while True:
        try:
            choose = int(input())
            if choose < 1 or choose > 4:
                print("\033[31m指令有误!\033[0m")
                continue
        except:
            print("\033[31m指令有误!\033[0m")
            continue
        return choose

display_banner()
choose = menu()

if choose == 1:
    survival.get_survival()
elif choose == 2:
    subdomain.get_submin()
elif choose == 3:
    port.get_port_ip()
elif choose == 4:
    finger.get_finger()
